for (let number = 2; number <= 100; number++) { // Цикл перебирает числа от 2 до 100, 0 и 1 не являются простыми числами
    let isPrime = true; // предполагаем, что число простое

    // Внутренний цикл ищет делители от 2 до (number - 1)
    for (let i = 2; i < number; i++) {
        // Если число делится на i без остатка
        if (number % i === 0) {
            isPrime = false; // Найдено опровержение: число составное
            break;           // Прерываем внутренний цикл
        }
    }

    // Если делителей без остатка не нашлось, выводим число
    if (isPrime) {
        console.log(number);
    }
}